## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 3 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:8",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.create_auth_challenge will be updated in-place
  ~ resource "aws_lambda_function" "create_auth_challenge" {
        id                             = "Cognito_Create_Auth_Challenge"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:create_auth_challenge_node_packages:3",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.define_auth_challenge will be updated in-place
  ~ resource "aws_lambda_function" "define_auth_challenge" {
        id                             = "Cognito_Define_Auth_Challenge"
      ~ last_modified                  = "2023-05-16T19:13:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "k1mJvWIRiUurYQcfIixvzHneHp5dtQq6fEYWU13s9TQ=" -> "Cc3ASDoIutzXXiH+tnoUGVQ8DNB7U43INl4bssgjglA="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:8" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-05-12T11:47:37.674+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "MJ4x0enhxJKYLBWFavI3WXDCxdr5VCHnkdQE06ER3XI=" -> "hOLIL0VRUCkRh6KFvMeP//1T2g0vaZQKESivPDon54U=" # forces replacement
      ~ source_code_size            = 14212627 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.create_auth_challenge_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "create_auth_challenge_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:create_auth_challenge_node_packages:3" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-05-12T11:47:46.164+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:create_auth_challenge_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:create_auth_challenge_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "mkqA98F9OdZRdcn2cBerbVVnn+kbd3YcGzr/Sswj5pA=" -> "xMwo8JPLZp+2zxhqBUQLEbbU5n8mPhIOyxYrMOV75Ag=" # forces replacement
      ~ source_code_size            = 14213809 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
